feedback = input("Напишіть ваш відгук курорту «Морська зірка»: ")
text = feedback.lower()
discount = 0
words= "меню", "спортзал", "обслуговування"
if "меню" in text:
    discount += 5
    print("Ви згадали 'меню' в вашому відгуку,"
          " знижку 5% нараховано! Знижка на наступне відвідування складає",
          discount, "%")
if "спортзал" in text:
    discount += 5
    print("Ви згадали 'спортзал' в вашому відгуку,"
          " знижку 5% нараховано! Знижка на наступне відвідування складає",
          discount, "%")
if "обслуговування" in text:
    discount += 5
    print("Ви згадали 'обслуговування' в вашому відгуку,"
            " знижку 5% нараховано! Знижка на наступне відвідування складає",
          discount, "%")
if len(text) > 60:
    discount += 15
    print("Ваш відгук достатньо довгий для додаткової знижки 15%"
          " Знижка на наступне відвідування складає",
          discount, "%")