# Дано числа a і b (a < b). Виведіть на екран суму всіх натуральних чисел від a до b (включно),
# які є кратними середньому арифметичному цього проміжку.

# Сумма чисел кратних середньому арифметичному
a = 1
b = 15
res = 0
saf = (a+b)/2
for i in range(a,b+1):
    if i % saf == 0:
        res += i
print(res)

# Сумма чисел для котрих середнье арифметичне є кратним

a = 1
b = 15
res = 0
saf = (a+b)/2
for i in range(a,b+1):
    if saf % i == 0:
        res += i
print(res)