# Створіть програму авторизації, в якій користувачеві дається 3 спроби ввести свої облікові дані (логін та пароль).
# Якщо користувач за меншу кількість спроб ввів вірні дані, програма достроково припиняє своє виконання
# та виводить на екран повідомлення: «Авторизацію успішно пройдено з «№» спроби».
login = str("login")
password = str("pass123")

for i in range(1, 4):
    check_1 = input("Введіть ваш логін: ")
    check_2 = input("Введіть ваш пароль: ")
    if check_1 == login and check_2 == password:
        print("Авторизацію успішно пройдено з", i, "спроби")
        break
    else:
        print("Не вірний логін чи пароль")
else:
    print("Авторизацію не пройдено")